// Автор: Прасков Дмитрий ИВТ-25
// Задача №11_D
package ZabGU; // пакеты позволяют организовать классы логически в наборы, позволяет избежать ошибок между имен классами

import java.util.Scanner; // Добавление класса для ввода данных


public class Main { // Объявление класса, в Java всё находится внутри классов. public - значит класс доступен извне, "N11_D" - имя класса, должно совпадать с именем файла
	
	public static void main(String[] args){ // Главный метод, String[] args - массив строк, переданных при запуске программы 
	
	Calculation.check(); // запускаем проверки
	
	Scanner in = new Scanner(System.in); // Создание объекта для ввода с клавиатуры
	
	// println - выводит значение и переводит курсор на новую строку
	System.out.println("Введите значения x, y, z:");
	
	// переменные для получения значения из функций
	double q=0.0, s=0.0;
	
	// Объект in, который мы создали в Scanner in, отвечает за чтение данных
	// .nextDouble() - специальный метод класса Scanner, который заставляет программу остановиться, ждать, пока пользователь не введёт число и не нажмёт Enter
	// затем преобразует ввод в тип double
	double x = in.nextDouble();
	double y = in.nextDouble();
	double z = in.nextDouble();
	
	q = Calculation.solve_a(x, y); // обращаемся к файлу "Calculation", а затем к функциям в этом модуле
	s = Calculation.solve_b(z);
	
	System.out.printf("Ответ под буквой a: %.4f \n", q); // printf - форматированный вывод как в C
	System.out.printf("Ответ под буквой b: %.4f \n", s);
	}
}